In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 30, 35, 40, 22],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Salary": [50000, 60000, 75000, 80000, 45000]
}

df = pd.DataFrame(data)

In [3]:
df.sort_values(by="Age")

      Name  Age         City  Salary
4      Eve   22      Phoenix   45000
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000
3    David   40      Houston   80000

In [6]:
df.sort_values(by="Age",ascending = False)

      Name  Age         City  Salary
3    David   40      Houston   80000
2  Charlie   35      Chicago   75000
1      Bob   30  Los Angeles   60000
0    Alice   25     New York   50000
4      Eve   22      Phoenix   45000

In [7]:
df.sort_values(by=["Salary","Age"],ascending = [False,True])

      Name  Age         City  Salary
3    David   40      Houston   80000
2  Charlie   35      Chicago   75000
1      Bob   30  Los Angeles   60000
0    Alice   25     New York   50000
4      Eve   22      Phoenix   45000

In [8]:
df.sort_index()

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000
3    David   40      Houston   80000
4      Eve   22      Phoenix   45000

In [12]:
print(df.set_index("Name"))

         Age         City  Salary
Name
Alice     25     New York   50000
Bob       30  Los Angeles   60000
Charlie   35      Chicago   75000
David     40      Houston   80000
Eve       22      Phoenix   45000

In [13]:
print(df.reset_index())

   index     Name  Age         City  Salary
0      0    Alice   25     New York   50000
1      1      Bob   30  Los Angeles   60000
2      2  Charlie   35      Chicago   75000
3      3    David   40      Houston   80000
4      4      Eve   22      Phoenix   45000

In [14]:
df.set_index(pd.RangeIndex(start=100,stop=105,step=1))

        Name  Age         City  Salary
100    Alice   25     New York   50000
101      Bob   30  Los Angeles   60000
102  Charlie   35      Chicago   75000
103    David   40      Houston   80000
104      Eve   22      Phoenix   45000

In [22]:
df.set_index("Name")

         Age         City  Salary
Name
Alice     25     New York   50000
Bob       30  Los Angeles   60000
Charlie   35      Chicago   75000
David     40      Houston   80000
Eve       22      Phoenix   45000

In [24]:
d = df.set_index("Name")

In [27]:
d.loc["Charlie"]

Age            35
City      Chicago
Salary      75000
Name: Charlie, dtype: object

In [30]:
d.loc[["Alice","David"]]

       Age      City  Salary
Name
Alice   25  New York   50000
David   40   Houston   80000

In [31]:
df.iloc[2]

Name      Charlie
Age            35
City      Chicago
Salary      75000
Name: 2, dtype: object

In [33]:
d1 = df.rename_axis("ID")
print(d1)

       Name  Age         City  Salary
ID
0     Alice   25     New York   50000
1       Bob   30  Los Angeles   60000
2   Charlie   35      Chicago   75000
3     David   40      Houston   80000
4       Eve   22      Phoenix   45000

In [ ]:
Sort by column	             df.sort_values(by="Age")
Sort descending	             df.sort_values(by="Age", ascending=False)
Sort by multiple columns	 df.sort_values(by=["Salary", "Age"], ascending=[False, True])
Sort by index	             df.sort_index()
Set column as index	         df.set_index("Name")
Reset index	                 df.reset_index()
Change index numbers	     df.set_index(pd.RangeIndex(100, 105))
Access row by label	         df.loc["Charlie"]
Access row by position	     df.iloc[2]
Rename index	             df.rename_axis("ID")